---
kind: other
id: Properties.T:Autodesk.Revit.UI.Selection.PickedBox
source: html/00e8d907-85aa-d1ad-7aaf-308f6524f07c.htm
---
# PickedBox Properties

Maximum coordinates (upper-right-front corner of the pick box).